# ==========================================================
# EarthMind
# Dependency Engine
# ==========================================================


class DependencyEngine:

    def apply(self, state):

        s = state.copy()

        # ======================
        # البيئة
        # ======================

        s["air"] += (
            s["forest"] - 50
        ) * 0.03

        s["water"] += (
            s["forest"] - 50
        ) * 0.02

        s["carbon"] -= (
            s["forest"] - 50
        ) * 0.04

        # ======================
        # التكنولوجيا والطاقة
        # ======================

        s["internet"] += (
            s["electricity"] - 50
        ) * 0.03

        s["education"] += (
            s["internet"] - 50
        ) * 0.02

        # ======================
        # البنية التحتية
        # ======================

        s["housing"] += (
            s["roads"] - 50
        ) * 0.03

        # ======================
        # Clamp
        # ======================

        for k in s:

            s[k] = max(
                0,
                min(
                    s[k],
                    100
                )
            )

        return s